---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
source: html/2f9010d5-2f50-5df3-03e1-50658f74e030.htm
---
# Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor Method

Creates a new instance of ReleaseConditions.

## Syntax (C#)
```csharp
public ReleaseConditions(
	bool start,
	bool fx,
	bool fy,
	bool fz,
	bool mx,
	bool my,
	bool mz
)
```

## Parameters
- **start** (`System.Boolean`) - The position on analytical element. True for start, false for end.
- **fx** (`System.Boolean`) - Fx of the release type.
- **fy** (`System.Boolean`) - Fy of the release type.
- **fz** (`System.Boolean`) - Fz of the release type.
- **mx** (`System.Boolean`) - Mx of the release type.
- **my** (`System.Boolean`) - My of the release type.
- **mz** (`System.Boolean`)